content/posts/os.md
+++
title = "Operating Systems"
author = ["Jacob Chvatal"]
lastmod = 2020-08-01T23:19:35-07:00
slug = "os"
draft = false
+++

Operating systems run your computer!

There are lots of innovative OS projects but only a few are really used.


## Projects {#projects}

Aside from Linux, Windows, MacOS and derivatives...
<https://github.com/tomaka/redshirt>
<https://gitlab.redox-os.org/redox-os/redox> is a Rust operating system with a microkernel-based design.
<https://github.com/urbit/urbit> is an operating system and framework that claims to be entirely functional
<https://github.com/toddsharpe/MetalOS> all by one guy!
<https://github.com/mntmn/interim> the interim os, written to accompany mntmn's custom hardware
<https://github.com/mchlmmc/CirnOS> os to use arduino on raspi (lmao)
<https://github.com/demikernel/demikernel> interesting approach to architecture
<https://github.com/cleverca22/not-os> operating system generator based on nixos
<https://github.com/vygr/ChrysaLisp> lisp machine!
TempleOS (racist)

<https://blog.quarkslab.com/playing-around-with-the-fuchsia-operating-system.html>
fuscia operating system sounds cool and fun, but ig we will see what happens
if it becomes more popular. this blog could also be useful as this person
seems knowledgeable

<https://www.paritybit.ca/blog/my-beginnings-with-gentoo>
<https://mirror.dernuntius.de/projects/wii-linux/> -- linux on the wii ???
<https://www.qubes-os.org/intro/>
<https://www.whonix.org/>
lineageos vs _e_
<https://wiki.lineageos.org/devices/starlte/install>
<https://news.ycombinator.com/item?id=23100713>


## Pi {#pi}

[wow!](https://wiki.xxiivv.com/site/raspberry.html)
[notmuch clients](https://notmuchmail.org/frontends/)
[type level programming](http://willcrichton.net/notes/)
[on discourse.](https://wiki.xxiivv.com/site/discourse.html)
[rules and indices for tensor and tensor fields!](https://en.m.wikipedia.org/wiki/Ricci%5Fcalculus)
[self hosting at home.](https://homelabos.com/)
[alot tutorial](https://alot.readthedocs.io/en/latest/)
[clustering with the raspi](https://www.youtube.com/watch?v=kgVz4-SEhbE&app=desktop)

<https://raspberrypi.stackexchange.com/questions/86/how-can-i-run-the-pi-on-solar-power>
pi on solar power
<https://100r.co/site/raspberry%5Fpi.html>
<https://www.lifehacker.com.au/2012/12/make-a-raspberry-pi-solar-powered-ftp-server/>
<https://www.instructables.com/id/Solar-Powered-Raspberry-Pi/>

[guitar in haskell](https://bartoszmilewski.com/2020/05/27/guitar-decomposed-5-mutating-the-third/)
[tools for sourcehut!](https://git.sr.ht/~ft/9pro)
[book by rahul khanna](https://link.springer.com/book/10.1007/978-1-4302-5990-9?utm%5Fsource=twitter&utm%5Fmedium=social&utm%5Fcontent=organic&utm%5Fcampaign=BBKK%5F1%5FDL01%5FGL%5Ftwitterorganic&sf234521345=1)
[obsidian md knowledge base](https://obsidian.md/)

<https://electro.pizza/2020/05/selfhosting-cloudshell2/> NAS self host with
documentation

<https://aperiodical.com/2020/06/review-immersive-linear-algebra/> review for
linalg
<https://blog.quarkslab.com/playing-around-with-the-fuchsia-operating-system.html>
fuscia operating system sounds cool and fun, but ig we will see what happens
if it becomes more popular. this blog could also be useful as this person
seems knowledgeable


## Mobile {#mobile}

<https://www.youtube.com/watch?v=WSNGK9gmdpg&app=desktop> intro to privacy on
android

<https://www.qubes-os.org/intro/> security os with microkernels that runs
everything in vms
<https://www.whonix.org/> anonymous linux desktop or somethign
<https://wiki.lineageos.org/devices/starlte/install> lineageos for the galaxy s9
<https://www.reddit.com/r/degoogle/comments/gu2kk9/lineageos%5Fvs%5Fe%5Fvs%5Falternatives/>

<https://github.com/redkyn> software for teaching programming
